{
    "version": "https://jsonfeed.org/version/1",
    "title": "alokdhari.com",
    "description": "",
    "home_page_url": "https://alokdhari.github.io/alokdhari.github.io",
    "feed_url": "https://alokdhari.github.io/alokdhari.github.io/feed.json",
    "user_comment": "",
    "icon": "https://alokdhari.github.io/alokdhari.github.io/media/website/logo-2-Alok-Blog.png",
    "author": {
        "name": "Alok Singh"
    },
    "items": [
        {
            "id": "https://alokdhari.github.io/alokdhari.github.io/how-to-become-a-morning-person/index.html",
            "url": "https://alokdhari.github.io/alokdhari.github.io/how-to-become-a-morning-person/index.html",
            "title": "Becoming a morning person - Part I - How?",
            "summary": "TLDR:Look after your body and your body will wake you up when you want. Let me be very honest with you, it was not easy.",
            "content_html": "<h2>TLDR:</h2>\n<p class=\"msg msg--success\">Look after your body and your body will wake you up when  you want.</p>\n<p>Let me be very honest with you, it was not easy. I am a coder by profession and my brain seems to work better in the calm of the late nights. In fact, it is same with a lot of coders. Go read this post at hacker news: <a href=\"https://news.ycombinator.com/item?id=20468870\" title=\"At what time of day do famous programmers work?\" target=\"_blank\" rel=\"nofollow noopener noreferrer\">At what time of day do famous programmers work?</a>!</p>\n<p>Regardless, I have my reasons and they are quite fair. I happen to be heading a team of devs who are based in India and I happen to be stuck in my home in South London. If I start working by normal hours, 9am, I would be bidding them goodbye after the stand-up. So, instead of my team spending their evenings working, I thought it would be better for me to start early. Well, early as in, getting up at about 3:30am or 4am and start working at 5am. </p>\n<p>So, we have a problem and a very viable solution. Only blocker was, as I said, I have been coder for past few years and love working late. </p>\n<h4>Attempt One</h4>\n<p>Let's brute force it, sleep early and wake up early. That did not seem to work for several reasons. Not able to sleep early was probably the biggest one. I was not able to sleep early was because I woke up late. And you know why I woke up late...</p>\n<h3>Attempt Two</h3>\n<p>Just wake up! <br>So this seemed to work for a bit. For about 3-4 weeks to be precise. I was sleeping at 11 pm and waking up at around 3:30 am. All alarm induced. My body and mind soon started suffering. Body first and then mind, really! The first symptom of my body suffering was, I would just sleep wherever. Sometimes while watching news and sometimes while working. The suffering of my mind was more delayed but when it showed up, it took a while for me to observe. The fact that me and wifey started having fights after 16 years of a relationship sums it up. </p>\n<p>Time to find a better solution.</p>\n<h3>Attempt Three</h3>\n<p>I needed a plan and I had to cleanse my mind and recover my sleep, so I went back to sleeping normally for a bit. By normal, I mean, sleeping before 10 pm and waking up after 4:30 am. I also started a few good habits, like drinking warm tea before sleeping and drinking a massive pint of warm water first thing after waking up. One more bit that I started doing was taking vitamin and mineral supplements. Just the standard multivitamin tablet TBH. It took me about 2 weeks for me to wake up at these times without an alarm, and that was my goal. Wake up naturally with a fresh mind. Once, that happened, it was time to experiment again. I tried sleeping at 9 pm and waking up at 3:30 am another day and to my surprise I woke up only a few minutes before the alarm started poking me. It was partly because of my excitement and partly because my body has had enough sleep. It was pure bliss to see my body respond so well to my mind. </p>\n<p>Pure Harmony..</p>\n<p>So here's my step by step process to start waking up early!</p>\n<table style=\"border-collapse: collapse; width: 100%;\" border=\"1\">\n<tbody>\n<tr>\n<td style=\"width: 9.93724%;\">Step</td>\n<td style=\"width: 15.3766%;\">Time</td>\n<td style=\"width: 74.6862%;\">What to do.</td>\n</tr>\n<tr>\n<td style=\"width: 9.93724%;\">1</td>\n<td style=\"width: 15.3766%;\">Day 1- 6</td>\n<td style=\"width: 74.6862%;\">\n<p>1. Fix a time to sleep and wake up 10 pm and 6 am is a good start.<br>2. Drink some herbal tea or warm water before sleeping. I would sip the tea with lights off and relax. Only go to bed when I was sleepy. This would be for a good 15 minutes. Love Pukka tea's (<a href=\"https://uk.pukkaherbs.com/products/peace\" target=\"_blank\" rel=\"noopener noreferrer\">Peace </a>and <a href=\"https://uk.pukkaherbs.com/products/organic-teas/turmeric-gold\" target=\"_blank\" rel=\"noopener noreferrer\">Turmeric </a>is my fav!)<br>3. Start taking vitamin and mineral supplements. This is only to make sure you body is happy.<br>4. Set the alarm and wake up. <br>5. Drink a big jug of warm water right after you wake up.<br>6. Stretch and do <a href=\"https://en.wikipedia.org/wiki/Surya_Namaskar\" title=\"Surya Namaskar\" target=\"_blank\" rel=\"noopener noreferrer\">Surya Namaskar</a></p>\n</td>\n</tr>\n<tr>\n<td style=\"width: 9.93724%;\">2</td>\n<td style=\"width: 15.3766%;\">Day 6-8</td>\n<td style=\"width: 74.6862%;\">1. Try losing the alarm and waking up on time. Put the alarm for 6:15 am and disable it after you wake up. Or even better, put a silent alarm of only lights and enjoy the light while you are drinking that warm water.<br>2. Prolong the time you relax before going to bed. This is in preparation for the next step. </td>\n</tr>\n<tr>\n<td style=\"width: 9.93724%;\">3</td>\n<td style=\"width: 15.3766%;\">Day 9-15</td>\n<td style=\"width: 74.6862%;\">\n<p>1. Sleep 30 minutes earlier than you would and see if you wake up 30 minutes earlier.<br>2. If you do then your body is in sync with you and would wake your mind up when you want. <br>3. If you don't then please repeat step 1 until you get to this point.</p>\n<p> </p>\n</td>\n</tr>\n</tbody>\n</table>\n<p>I am not very very comfortable with my sleeping pattern and wake up really fresh with a lot of enthusiasm and hope for the day regardless of how my previous day was. </p>\n<p>In the next part I will discuss WHY to become a morning person and what positive and negative changes I have observed.</p>\n<p>Good luck with your experiments. :)</p>\n<p> </p>",
            "author": {
                "name": "Alok Singh"
            },
            "tags": [
            ],
            "date_published": "2021-03-03T21:19:36+00:00",
            "date_modified": "2021-03-03T21:20:19+00:00"
        },
        {
            "id": "https://alokdhari.github.io/alokdhari.github.io/lessons-learned-from-hiring-junior-devs/index.html",
            "url": "https://alokdhari.github.io/alokdhari.github.io/lessons-learned-from-hiring-junior-devs/index.html",
            "title": "Lessons learned from hiring junior devs..",
            "author": {
                "name": "Alok Singh"
            },
            "tags": [
            ],
            "date_published": "2020-12-17T13:16:10+00:00",
            "date_modified": "2020-12-17T13:16:10+00:00"
        },
        {
            "id": "https://alokdhari.github.io/alokdhari.github.io/seeds-and-opportunities/index.html",
            "url": "https://alokdhari.github.io/alokdhari.github.io/seeds-and-opportunities/index.html",
            "title": "Seeds and opportunities",
            "summary": "<p>There are only very few times in life when one can see the vivid change of direction one's life is making. When one picks up the book on gardening and decides to grow their own veggies or when one signs up to that swimming class for they finally not scared of learning how to not drown. </p>\n<p>Today is one of those days for me!</p>\n",
            "content_html": "<p>There are only very few times in life when one can see the vivid change of direction one's life is making. When one picks up the book on gardening and decides to grow their own veggies or when one signs up to that swimming class for they finally not scared of learning how to not drown. </p>\n<p>Today is one of those days for me!</p>\n\n<p>I have resigned from my permanent job at Capital On Tap. Brave, foolish, ambitious or stupid, only time will tell. What I can tell you is this has been something that's been cooking for a while. When I came to the UK, I was taken back by how much there was to learn and how much everyone had to teach. At all points since then I have had people I could look up to and people who were there for me. While I had help but that help was never material, always emotional. That, along with a good dose of optimism has given me the strength to start something of my own. A place which I can call home and a work where I do what I feel is right. </p>\n<p>So, here I am! I am going to be a part of a team who will create and launch an eCommerce platform that will be driven by simplicity and will command a lot of social return. One where the tech and team will be inclusive and genuine. </p>\n<p>We have also managed to find a great name for it: <strong>Kuber Digital</strong></p>\n<p>While the world is in its whirlwind, we have decided to brave the tides and start a sustainable business which gives something back to the society. </p>\n<p>Ride along with me on this amazing adventure of mine.</p>\n<p> </p>",
            "image": "https://alokdhari.github.io/alokdhari.github.io/media/posts/5/jill-heyer-03ztkGdYWU8-unsplash.jpg",
            "author": {
                "name": "Alok Singh"
            },
            "tags": [
                   "Life"
            ],
            "date_published": "2020-10-31T00:44:07+00:00",
            "date_modified": "2020-10-31T00:46:17+00:00"
        },
        {
            "id": "https://alokdhari.github.io/alokdhari.github.io/meditation-and-me/index.html",
            "url": "https://alokdhari.github.io/alokdhari.github.io/meditation-and-me/index.html",
            "title": "Meditation and Me!",
            "summary": "<h2 class=\"align-left\">Meditation</h2>\n<p class=\"align-left\">A state of mind where you and your brain seem to be different entities, and you may or may not choose to observe your thoughts. So basically put your mind to ease and watch those horses of thoughts run around until they give up and give way to control and clean consciousness. </p>\n<p class=\"align-left\">Simple?</p>\n",
            "content_html": "<h2 class=\"align-left\">Meditation</h2>\n<p class=\"align-left\">A state of mind where you and your brain seem to be different entities, and you may or may not choose to observe your thoughts. So basically put your mind to ease and watch those horses of thoughts run around until they give up and give way to control and clean consciousness. </p>\n<p class=\"align-left\">Simple?</p>\n\n<p class=\"align-left\">Not really. Actually quite hard. It is very very very similar to killing one self by not breathing. GO ON, try it! Not killing yourself but stop breathing for a bit. While you can chose to do so for a very limited time, you will eventually gasp and give up. Your mind and thoughts are similarly entwined. What is the point you ask? Well, the point is to control the breathing for as long as you can. </p>\n<p class=\"align-left\">Let's get deeper into this analogy.. <br>One can hold on to their breath for 30 seconds and hold on to a thought for 5 seconds. They start breathing exercise and eventually prolongs their hold on breath for a minute. Similarly, one meditates to prolong the time one can hold a thought for. </p>\n<h2 class=\"align-left\">Me</h2>\n<p>I have been on this roller coaster to try to meditate and then not able to either find time or focus long enough. This stops now! I mean it! Really!<br><br>Akin to writing everyday, I am going to meditate as well. 🧘‍♂️</p>\n<p>Different people meditate for different reasons. I am yet to truly discover mine. Part of me wants to believe that it will address certain issues with my ability to focus and stay calm. There's also a part that hopes I might be able to meet the goddess of nature or fly to distant realms. Well, either way, what matters is there is a lot to be gained by this. Definitely more mental peace. </p>\n<p class=\"align-left\"> </p>",
            "image": "https://alokdhari.github.io/alokdhari.github.io/media/posts/3/wilsan-u-aiUIs74ejx8-unsplash-2.jpg",
            "author": {
                "name": "Alok Singh"
            },
            "tags": [
                   "Life"
            ],
            "date_published": "2020-10-14T22:08:53+01:00",
            "date_modified": "2020-10-14T22:29:58+01:00"
        },
        {
            "id": "https://alokdhari.github.io/alokdhari.github.io/here-goes-nothing/index.html",
            "url": "https://alokdhari.github.io/alokdhari.github.io/here-goes-nothing/index.html",
            "title": "Here goes nothing!",
            "summary": "In hindsight, which always seems to be a beautiful thing.. this has been an overdue dream. Writing blogs or rather finding time to do so.",
            "content_html": "<p class=\"align-left\">In hindsight, which always seems to be a beautiful thing.. this has been an overdue dream. Writing blogs or rather finding time to do so. So here we are!<br><br>Another punt at doing this, when I finally feel as old as blogging itself is probably.</p>\n<p>So, where are we? I am right where I was in many ways. The time just seems to be moving on. It has been over 10 years now that I came with 2 bags full of hopes and dreams this island of a Nation. I have met some great and amazing people, and most of all, have made a life here. I mean literally.. my daughter!</p>\n<p class=\"msg msg--highlight \">Everything was great until an invisible non-living flying blob of rna started attacking our species.. </p>\n<p>That said, I think I am in a good place. Have my amazing wife and a beautiful baby girl, who are always there to cheer me up. </p>\n<p class=\"align-left\">Stay posted and in check. Big things are happening.. my life is about to take a very very exiting turn and hopefully for the better. 😬</p>",
            "image": "https://alokdhari.github.io/alokdhari.github.io/media/posts/1/lonelyChair.jpg",
            "author": {
                "name": "Alok Singh"
            },
            "tags": [
                   "Life"
            ],
            "date_published": "2020-10-13T19:04:00+01:00",
            "date_modified": "2020-10-14T22:20:55+01:00"
        }
    ]
}
